Catalogs/А_Статьи_PL.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>А_Статьи_PL</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СтатьяДвиженияДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Группа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.А_ГруппаСтатей_PL</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДоходов</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиДоходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСтатьи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.А_ТипСтатьиPL</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>А_СозданоАвтоматически</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>А_РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьиКраткоеСодержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Статьи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтатьяДвиженияДенежныхСредств</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

AccumulationRegisters/ПрочиеРасходы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<AccumulationRegister>
		<Properties>
			<Name>ПрочиеРасходы</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаБезНДС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРегл</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРеглБезНДС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НДСРегл</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПостояннаяРазница</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВременнаяРазница</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпрБезНДС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АналитикаУчетаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлючиАналитикиУчетаНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетКт</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПрочихАктивов</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументДвижения</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РаспределениеПрочихЗатрат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорСтатьяРасходов</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорОрганизация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоляСтоимости</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорАналитикаРасходов</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.СтатьиРасходов</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаПродукции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыАналитическогоУчетаНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорСтатьяКалькуляции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиКалькуляции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетСебестоимости</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетПартий</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторСтроки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорНаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьИсточникДвижений</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УдалитьИсточникиДвижений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорОбъектУчетаРезервов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыУчетаРезервовПредстоящихРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорВидРезервов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Резервы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидИсточника</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыИсточниковДвижений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаХозяйственнойОперации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиХозяйственныхОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторФинЗаписи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>А_ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НалоговоеНазначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НалоговыеНазначенияАктивовИЗатрат</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяРасходов</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиРасходов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>АналитикаРасходов</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.СтатьиРасходов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФормаPL</Name>
					<Type>
						<v8:Type>cfg:EnumRef.А_ФормыPL</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/А_ТипСтатьиPL.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>А_ТипСтатьиPL</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Доход</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расход</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОперационныйИтог</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Информационный</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/А_Статьи_PL/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// ПередЗаписью() — контроль целостности справочника А_Статьи_PL.
//
// Правила:
//   1. Для расходных статей (ТипСтатьи = Расход) — шапочная ДДС обязательна.
//   2. Если шапочная ДДС заполнена — ТЧ "Статьи" не пустая и шапка присутствует в ТЧ.
//   3. В ТЧ недопустимы пустые строки.
//   4. Уникальность: каждая ДДС из ТЧ не должна использоваться в другой PL-статье,
//      ЗА ИСКЛЮЧЕНИЕМ случая, когда эта ДДС не имеет оборотов в
//      РегистрНакопления.ПрочиеРасходы за последние 12 месяцев
//      (shared-ДДС без данных — не влияет на паритет отчёта с АДР).
//
// При нарушении — ВызватьИсключение с понятным сообщением, запись отказывается.
//
Процедура ПередЗаписью(Отказ)

	Если ОбменДанными.Загрузка ИЛИ ЭтоГруппа ИЛИ ПометкаУдаления Тогда
		Возврат;
	КонецЕсли;
	
	Если  ЭтоГруппа  Тогда
		Возврат;
	КонецЕсли;
	
	ТипРасхода = ТипСтатьи = Перечисления.А_ТипСтатьиPL.Расход;

	// Правило 1 — шапочная ДДС для расходов
	Если ТипРасхода И НЕ ЗначениеЗаполнено(СтатьяДвиженияДенежныхСредств) Тогда
		// Исключения: PL-статьи, которые изначально без ДДС (нет аналога в АДР)
		Если Не ЭтоРасходИсключениеБезДДС() Тогда
			ВызватьИсключение "Для расходной статьи PL «" + Наименование +
				"» обязательно заполнить поле ""Статья движения денежных средств"" в шапке.";
		КонецЕсли;
	КонецЕсли;

	// Правило 2 + 3 — ТЧ Статьи согласована с шапкой
	Если ЗначениеЗаполнено(СтатьяДвиженияДенежныхСредств) Тогда
		Если Статьи.Количество() = 0 Тогда
			ВызватьИсключение "Табличная часть ""Статьи"" у PL «" + Наименование +
				"» не может быть пустой: должна содержать минимум 1 строку с шапочной ДДС.";
		КонецЕсли;
		ШапочнаяВТЧ = Ложь;
		Для Каждого Стр Из Статьи Цикл
			Если НЕ ЗначениеЗаполнено(Стр.СтатьяДвиженияДенежныхСредств) Тогда
				ВызватьИсключение "Пустая строка в ТЧ ""Статьи"" у PL «" + Наименование + "» недопустима.";
			КонецЕсли;
			Если Стр.СтатьяДвиженияДенежныхСредств = СтатьяДвиженияДенежныхСредств Тогда
				ШапочнаяВТЧ = Истина;
			КонецЕсли;
		КонецЦикла;
		Если НЕ ШапочнаяВТЧ Тогда
			ВызватьИсключение "Шапочная ДДС «" + СтатьяДвиженияДенежныхСредств +
				"» должна присутствовать в ТЧ ""Статьи"" у PL «" + Наименование + "».";
		КонецЕсли;
	КонецЕсли;

	// Правило 4 — уникальность ДДС между PL-статьями
	// Собираем список ДДС из ТЧ
	ДДСМассив = Новый Массив;
	Для Каждого Стр Из Статьи Цикл
		Если ЗначениеЗаполнено(Стр.СтатьяДвиженияДенежныхСредств) Тогда
			ДДСМассив.Добавить(Стр.СтатьяДвиженияДенежныхСредств);
		КонецЕсли;
	КонецЦикла;

	Если ДДСМассив.Количество() > 0 Тогда
		// Найти другие PL-статьи, использующие те же ДДС
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ТЧ.СтатьяДвиженияДенежныхСредств КАК ДДС,
		|	ТЧ.Ссылка КАК PLСсылка
		|ИЗ Справочник.А_Статьи_PL.Статьи КАК ТЧ
		|ГДЕ ТЧ.СтатьяДвиженияДенежныхСредств В (&ДДСМассив)
		|	И ТЧ.Ссылка <> &Ссылка
		|	И НЕ ТЧ.Ссылка.ПометкаУдаления";
		Запрос.УстановитьПараметр("ДДСМассив", ДДСМассив);
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		ТЗКонфликтов = Запрос.Выполнить().Выгрузить();

		Если ТЗКонфликтов.Количество() > 0 Тогда
			// Проверить: у конфликтной ДДС есть обороты в АДР за 12 месяцев?
			// Если сумма = 0 → shared-ДДС, разрешаем.
			// Если > 0 → падаем с сообщением.
			НачалоПериода = ДобавитьМесяц(НачалоМесяца(ТекущаяДатаСеанса()), -12);
			КонецПериода = КонецМесяца(ТекущаяДатаСеанса());

			ДДСКонфликтов = Новый Массив;
			Для Каждого СтрК Из ТЗКонфликтов Цикл
				Если ДДСКонфликтов.Найти(СтрК.ДДС) = Неопределено Тогда
					ДДСКонфликтов.Добавить(СтрК.ДДС);
				КонецЕсли;
			КонецЦикла;

			ЗапрОборот = Новый Запрос;
			ЗапрОборот.Текст =
			"ВЫБРАТЬ
			|	Об.СтатьяРасходов.А_СтатьяДвиженияДенежныхСредств КАК ДДС,
			|	СУММА(Об.СуммаРеглПриход) КАК Сумма
			|ИЗ РегистрНакопления.ПрочиеРасходы.Обороты(&НП, &КП, , ) КАК Об
			|ГДЕ Об.СтатьяРасходов.А_СтатьяДвиженияДенежныхСредств В (&ДДСМассив)
			|СГРУППИРОВАТЬ ПО Об.СтатьяРасходов.А_СтатьяДвиженияДенежныхСредств
			|ИМЕЮЩИЕ СУММА(Об.СуммаРеглПриход) > 0";
			ЗапрОборот.УстановитьПараметр("НП", НачалоПериода);
			ЗапрОборот.УстановитьПараметр("КП", КонецПериода);
			ЗапрОборот.УстановитьПараметр("ДДСМассив", ДДСКонфликтов);
			ТЗОбороты = ЗапрОборот.Выполнить().Выгрузить();

			Если ТЗОбороты.Количество() > 0 Тогда
				// Есть реальные обороты — падаем
				ТекстОшибки = "ДДС не может использоваться одновременно в нескольких PL-статьях, если по ней есть обороты в АДР." + Символы.ПС;
				ТекстОшибки = ТекстОшибки + "Проблемные ДДС:" + Символы.ПС;
				Для Каждого СтрО Из ТЗОбороты Цикл
					// найти конкурирующую PL
					КонкурПЛ = "";
					Для Каждого СтрК Из ТЗКонфликтов Цикл
						Если СтрК.ДДС = СтрО.ДДС Тогда
							КонкурПЛ = КонкурПЛ + " '" + СтрК.PLСсылка + "'";
						КонецЕсли;
					КонецЦикла;
					ТекстОшибки = ТекстОшибки + "  - " + СтрО.ДДС + " (сумма " + Формат(СтрО.Сумма, "ЧГ=") + " ₴): уже в " + КонкурПЛ + Символы.ПС;
				КонецЦикла;
				ТекстОшибки = ТекстОшибки + "Решение: уберите эту ДДС из ТЧ ""Статьи"" одной из PL-статей (оставьте только в той, куда должна попадать сумма).";
				ВызватьИсключение ТекстОшибки;
			КонецЕсли;
			// Если сумма = 0 (shared-ДДС без оборотов) → проходим дальше, запись разрешена.
		КонецЕсли;
	КонецЕсли;
	
	
	Если НЕ ЭтоГруппа Тогда
	  Строка_СтатьиКраткоеСодержание="";
	Для каждого СтрокаТЗ Из Статьи Цикл
	   Строка_СтатьиКраткоеСодержание = Строка_СтатьиКраткоеСодержание + СокрЛП(СтрокаТЗ.СтатьяДвиженияДенежныхСредств)+"; ";
		
	
	КонецЦикла;	
	СтатьиКраткоеСодержание =Строка_СтатьиКраткоеСодержание;
	КонецЕсли;
КонецПроцедуры

// Возвращает Истина, если PL-статья входит в список известных исключений,
// у которых нет аналога в РегистрНакопления.ПрочиеРасходы (инвест.деятельность, финансовая).
Функция ЭтоРасходИсключениеБезДДС()

	// Коды PL-статей, для которых ДДС отсутствует сознательно
	ИсключенияКодов = Новый Массив;
	ИсключенияКодов.Добавить("000000028"); // Расход от ивест. Деятельности (ОС)
	ИсключенияКодов.Добавить("000000056"); // Финансовые расходы

	Возврат ИсключенияКодов.Найти(Код) <> Неопределено;

КонецФункции

#КонецЕсли
